<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f5466e1c9251cb230353007f4818fbdca3dff0c4aa2ca223fa12c44553d67920","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #946 at https://github.com/cal-itp/data-infra/actions/runs/19179259236","plan_out_hash":"17a368cf710bb081c74298dbd52029d3487eae97a506f09c096998f7e598e732","plan_hash":"04002bdaa37fd3688748a6d3e0708c39ef0a56b3b34504dbfd147a818bffef36","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/agency_information/2024_annual_database_agency_information.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_ntd_data_xlsx/agency_information/2024_annual_database_agency_information.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_ntd_data_xlsx/agency_information/2024_annual_database_agency_information.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/contractual_relationship/2024_annual_database_contractual_relationship.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_ntd_data_xlsx/contractual_relationship/2024_annual_database_contractual_relationship.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_ntd_data_xlsx/contractual_relationship/2024_annual_database_contractual_relationship.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "kOOlGw==" -> (known after apply)
!~      detect_md5hash      = "6CU6V5hzNoFHNbWZ0WYaLA==" -> "different hash"
!~      generation          = 1757426419375148 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
!~      md5hash             = "6CU6V5hzNoFHNbWZ0WYaLA==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/ckan_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "o6P0TA==" -> (known after apply)
!~      detect_md5hash      = "Km769hbW7H0scQOxvUBZFQ==" -> "different hash"
!~      generation          = 1762477298871916 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/ckan_hook.py"
!~      md5hash             = "Km769hbW7H0scQOxvUBZFQ==" -> (known after apply)
        name                = "plugins/hooks/ckan_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "8BBB2Q==" -> (known after apply)
!~      detect_md5hash      = "acBkOjluXjOyhdfmLuIIdQ==" -> "different hash"
!~      generation          = 1762477298832746 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "acBkOjluXjOyhdfmLuIIdQ==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #946](https://github.com/cal-itp/data-infra/actions/runs/19179259236)